[
    {
      "commonName": "Tulsi (Holi Basil)",
      "scientificName": "Ocimum tenuiflorum",
      "image": "tulsi",
      "type": ["medicinal", "religious", "luck"],
      "use": "Used in Ayurvedic medicine for colds, cough, and flu. Also has religious significance in Hindu households.",
      "waterNeeds": "Moderate; water when top inch of soil feels dry",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Pinch off flower buds to encourage leaf growth. Prune regularly to maintain bushy growth. Protect from frost.",
      "storageTips": "Dry leaves in shade and store in airtight container. Fresh leaves can be refrigerated for up to a week.",
      "growthForm": "Perennial herb growing to 30-60 cm tall",
      "specification": "Considered sacred in Hinduism. Different varieties include Krishna Tulsi (purple leaves) and Rama Tulsi (green leaves)."
    },
    {
      "commonName": "Neem",
      "scientificName": "Azadirachta indica",
      "image": "tulsi",
      "type": ["medicinal", "food"],
      "use": "Used in traditional medicine for skin diseases, fever, and infections. Young leaves used in cooking. Oil used in cosmetics and as natural pesticide.",
      "waterNeeds": "Low; drought-tolerant once established",
      "sunlightNeeds": "Full sun",
      "careTips": "Tolerates poor soil. Fertilize minimally. Protect young plants from frost.",
      "storageTips": "Dry leaves in shade and store in airtight containers. Neem oil should be stored in dark bottles.",
      "growthForm": "Evergreen tree growing up to 15-20 meters",
      "specification": "Known as 'village pharmacy' due to its numerous medicinal properties. Can live for 150-200 years."
    },
    {
      "commonName": "Turmeric",
      "scientificName": "Curcuma longa",
      "image": "tulsi",
      "type": ["medicinal", "food"],
      "use": "Rhizomes used as spice in cooking, in religious ceremonies, and for medicinal purposes like anti-inflammation and wound healing.",
      "waterNeeds": "High; keep soil consistently moist but not waterlogged",
      "sunlightNeeds": "Partial shade to full shade",
      "careTips": "Plant in rich, well-draining soil. Mulch to retain moisture. Harvest when leaves turn yellow.",
      "storageTips": "Store fresh rhizomes in a cool, dark place or refrigerate. Dried powder in airtight containers.",
      "growthForm": "Perennial herb growing to 1 meter tall",
      "specification": "Contains curcumin, which gives it bright yellow color and medicinal properties. Grows best in temperatures between 20-30°C."
    },
    {
      "commonName": "Indian Gooseberry (Amla)",
      "scientificName": "Phyllanthus emblica",
      "image": "tulsi",
      "type": ["medicinal", "food"],
      "use": "High in Vitamin C. Used in Ayurvedic medicine for digestion, diabetes, and immunity. Fruits eaten fresh or processed.",
      "waterNeeds": "Moderate; water deeply but infrequently",
      "sunlightNeeds": "Full sun",
      "careTips": "Prune after fruiting. Apply organic manure annually. Protect from strong winds.",
      "storageTips": "Fresh fruits last 1-2 weeks in refrigeration. Can be preserved in salt water or made into preserves.",
      "growthForm": "Deciduous tree growing up to 8-18 meters",
      "specification": "Extremely high vitamin C content - one fruit contains as much vitamin C as 2-3 oranges. Fruits are harvested in autumn."
    },
    {
      "commonName": "Aloe Vera",
      "scientificName": "Aloe barbadensis miller",
      "image": "tulsi",
      "type": ["medicinal", "decorative"],
      "use": "Gel used for skin care, burns, and wounds. Also used in beverages and food products.",
      "waterNeeds": "Low; allow soil to dry completely between watering",
      "sunlightNeeds": "Bright indirect light to partial sun",
      "careTips": "Plant in well-draining soil. Repot when rootbound. Protect from frost.",
      "storageTips": "Fresh gel can be refrigerated for up to a week. Can be frozen in ice cube trays.",
      "growthForm": "Succulent with thick, fleshy leaves growing in a rosette",
      "specification": "Contains over 75 active compounds. Inner leaf gel is clear and soothing. Outer leaf contains aloin which has laxative properties."
    },
    {
      "commonName": "Curry Leaf Plant",
      "scientificName": "Murraya koenigii",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used as flavoring in South Indian cuisine. Also used in folk medicine for digestive problems.",
      "waterNeeds": "Moderate; keep soil lightly moist",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Fertilize every 2-3 months. Prune to maintain shape. May drop leaves in winter.",
      "storageTips": "Fresh leaves can be refrigerated for up to two weeks. Can be dried or frozen for longer storage.",
      "growthForm": "Small evergreen tree or shrub growing up to 4-6 meters",
      "specification": "Aromatic leaves with distinct curry-like fragrance. Seeds and bark also have medicinal properties."
    },
    {
      "commonName": "Ashwagandha",
      "scientificName": "Withania somnifera",
      "image": "tulsi",
      "type": ["medicinal"],
      "use": "Root used in Ayurveda as adaptogen for stress, anxiety, and improving energy levels.",
      "waterNeeds": "Low; drought-tolerant once established",
      "sunlightNeeds": "Full sun",
      "careTips": "Grows in poor soil. Space plants 60 cm apart. Protect from excessive moisture.",
      "storageTips": "Harvest roots after 1 year. Dry thoroughly and store in airtight containers.",
      "growthForm": "Erect shrub growing up to 1.5 meters tall",
      "specification": "Known as 'Indian Ginseng'. Berries can be used for seed propagation. Contains withanolides with medicinal properties."
    },
    {
      "commonName": "Indian Marigold",
      "scientificName": "Tagetes erecta",
      "image": "tulsi",
      "type": ["decorative", "religious", "medicinal"],
      "use": "Used in religious ceremonies, as garden ornamentals, and as companion plants to repel pests.",
      "waterNeeds": "Moderate; allow top soil to dry between watering",
      "sunlightNeeds": "Full sun",
      "careTips": "Deadhead spent flowers to encourage more blooms. Can be grown from seeds or cuttings.",
      "storageTips": "Flowers can be dried and used for garlands. Seeds can be collected when flowers dry on the plant.",
      "growthForm": "Annual herb growing up to 0.5-1 meter tall",
      "specification": "Widely used in Diwali and other Hindu ceremonies. Contains lutein which is beneficial for eye health."
    },
    {
      "commonName": "Indian Rosewood (Sheesham)",
      "scientificName": "Dalbergia sissoo",
      "image": "tulsi",
      "type": ["decorative"],
      "use": "Valued for its hard timber used in furniture making, carving, and construction.",
      "waterNeeds": "Moderate; established trees are drought-tolerant",
      "sunlightNeeds": "Full sun",
      "careTips": "Prune to maintain shape. Watch for pests like defoliators and borers.",
      "storageTips": "Not applicable for home storage as it's primarily grown for timber.",
      "growthForm": "Deciduous tree growing up to 25 meters tall",
      "specification": "Fast-growing species that also helps in preventing soil erosion. Wood has a distinctive grain pattern and reddish-brown color."
    },
    {
      "commonName": "Lemongrass",
      "scientificName": "Cymbopogon citratus",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Used in cooking for its citrus flavor, in teas, and in essential oils for aromatherapy.",
      "waterNeeds": "Moderate; keep soil consistently moist",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Divide clumps every 2-3 years. Cut back to 15 cm occasionally to promote fresh growth.",
      "storageTips": "Fresh stalks can be refrigerated for up to 3 weeks. Can be frozen or dried for longer storage.",
      "growthForm": "Perennial grass growing in clumps up to 1-1.5 meters tall",
      "specification": "Contains citral which gives it distinctive lemon scent. Also acts as natural mosquito repellent."
    },
    {
      "commonName": "Indian Lotus",
      "scientificName": "Nelumbo nucifera",
      "image": "tulsi",
      "type": ["decorative", "religious", "food", "medicinal"],
      "use": "National flower of India. Used in religious ceremonies. Seeds, young leaves, and rhizomes eaten as food.",
      "waterNeeds": "Very high; aquatic plant that needs standing water",
      "sunlightNeeds": "Full sun",
      "careTips": "Plant in containers with no drainage holes filled with heavy clay soil. Water depth should be 15-30 cm above soil.",
      "storageTips": "Seeds can be dried and stored. Rhizomes can be harvested and stored like potatoes.",
      "growthForm": "Aquatic perennial with rhizomes anchored in mud",
      "specification": "Flowers and leaves are water-repellent due to the 'lotus effect'. All parts of the plant are used in Ayurvedic medicine."
    },
    {
      "commonName": "Indian Mustard",
      "scientificName": "Brassica juncea",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Seeds used for oil and spice. Leaves used as vegetable. Oil cake used as animal feed and fertilizer.",
      "waterNeeds": "Moderate; sensitive to both drought and waterlogging",
      "sunlightNeeds": "Full sun",
      "careTips": "Sow directly in well-draining soil. Thin seedlings to 15 cm apart. Harvest when pods turn yellow.",
      "storageTips": "Store seeds in airtight containers in cool, dry place. Oil should be stored away from direct light.",
      "growthForm": "Annual herb growing up to 1-2 meters tall",
      "specification": "Cold-pressed mustard oil is commonly used in North Indian cooking. Also used in crop rotation for its bio-fumigation properties."
    },
    {
      "commonName": "Banyan Tree",
      "scientificName": "Ficus benghalensis",
      "image": "tulsi",
      "type": ["religious", "medicinal", "luck"],
      "use": "National tree of India with religious significance. Bark and roots used in traditional medicine.",
      "waterNeeds": "Moderate; established trees are drought-tolerant",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Not suitable for home growing due to massive size. Young plants need protection from frost.",
      "storageTips": "Not applicable for home storage; primarily an outdoor specimen tree.",
      "growthForm": "Evergreen tree with aerial roots that can spread over hectares",
      "specification": "Can live for several hundred years. The Great Banyan in Howrah is over 250 years old and covers an area of 14,500 square meters."
    },
    {
      "commonName": "Jasmine (Mogra)",
      "scientificName": "Jasminum sambac",
      "image": "tulsi",
      "type": ["decorative", "religious", "luck"],
      "use": "Flowers used in religious ceremonies, perfumes, and garlands. Also used to flavor tea.",
      "waterNeeds": "Moderate; keep soil evenly moist",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Regular pruning after flowering. Apply balanced fertilizer during growing season.",
      "storageTips": "Fresh flowers last only a few days. Can be dried or used to make potpourri.",
      "growthForm": "Evergreen vine or shrub growing up to 2-3 meters tall",
      "specification": "Flowers open at night and release strongest fragrance in evening. Several varieties grown in India include single and double-flowered forms."
    },
    {
      "commonName": "Indian Sandalwood",
      "scientificName": "Santalum album",
      "image": "tulsi",
      "type": ["medicinal", "religious", "decorative"],
      "use": "Heartwood and oil used in perfumes, religious ceremonies, and carving. Has cooling properties in Ayurveda.",
      "waterNeeds": "Moderate; drought-tolerant once established",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Requires host plants initially as it's semi-parasitic. Grows slowly and needs protection from frost.",
      "storageTips": "Heartwood can be stored indefinitely. Oil should be stored in dark glass bottles.",
      "growthForm": "Evergreen tree growing up to 12-15 meters tall",
      "specification": "Trees must be at least 30 years old before harvesting for quality heartwood. Protected species in India due to overexploitation."
    },
    {
      "commonName": "Brahmi",
      "scientificName": "Bacopa monnieri",
      "image": "tulsi",
      "type": ["medicinal"],
      "use": "Used in Ayurveda for improving memory, reducing anxiety, and treating epilepsy.",
      "waterNeeds": "High; prefers consistently wet soil",
      "sunlightNeeds": "Partial shade",
      "careTips": "Grows well in shallow water or very moist soil. Can be grown indoors in containers with no drainage.",
      "storageTips": "Fresh leaves can be refrigerated briefly. Usually dried and stored in airtight containers for medicinal use.",
      "growthForm": "Creeping herb with small white flowers",
      "specification": "Contains bacosides which support cognitive function. Often confused with Centella asiatica, which is also called Brahmi in northern India."
    },
    {
      "commonName": "Peepal Tree (Sacred Fig)",
      "scientificName": "Ficus religiosa",
      "image": "tulsi",
      "type": ["religious", "medicinal", "luck"],
      "use": "Sacred tree in Buddhism and Hinduism. Bark, fruit, and leaves used in traditional medicine.",
      "waterNeeds": "Moderate; drought-tolerant once established",
      "sunlightNeeds": "Full sun",
      "careTips": "Not suitable for home growing due to massive size and invasive roots. Young plants need protection from frost.",
      "storageTips": "Not applicable for home storage; primarily an outdoor specimen tree.",
      "growthForm": "Deciduous tree growing up to 30 meters tall",
      "specification": "Distinctive heart-shaped leaves with long drip tips. Buddha is said to have attained enlightenment under this tree."
    },
    {
      "commonName": "Bitter Gourd (Karela)",
      "scientificName": "Momordica charantia",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Fruit used in cooking and traditional medicine, particularly for diabetes management.",
      "waterNeeds": "Moderate; water when top inch of soil feels dry",
      "sunlightNeeds": "Full sun",
      "careTips": "Provide trellis for climbing. Add compost before planting. Harvest when fruits are still green.",
      "storageTips": "Fresh fruits can be refrigerated for up to a week. Can be blanched and frozen for longer storage.",
      "growthForm": "Annual climbing vine growing up to 5 meters long",
      "specification": "Contains charantin which helps lower blood glucose levels. Fruits become more bitter as they mature and turn orange."
    },
    {
      "commonName": "Bael (Wood Apple)",
      "scientificName": "Aegle marmelos",
      "image": "tulsi",
      "type": ["religious", "food", "medicinal"],
      "use": "Fruit used in religious offerings to Lord Shiva, in beverages, and for treating digestive disorders.",
      "waterNeeds": "Low; drought-tolerant once established",
      "sunlightNeeds": "Full sun",
      "careTips": "Prune to maintain shape. Fertilize annually. Protect young plants from frost.",
      "storageTips": "Fresh fruit can be stored up to 2 weeks. Pulp can be dried or made into preserves.",
      "growthForm": "Deciduous tree growing up to 12-15 meters tall",
      "specification": "Hard-shelled fruit with aromatic pulp. Slow-growing but can live for over 100 years."
    },
    {
      "commonName": "Night Jasmine (Harsingar)",
      "scientificName": "Nyctanthes arbor-tristis",
      "image": "tulsi",
      "type": ["medicinal", "decorative", "religious"],
      "use": "Flowers used for garlands and religious offerings. Leaves used in traditional medicine for sciatica and arthritis.",
      "waterNeeds": "Moderate; tolerates brief drought periods",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Prune after flowering to maintain shape. Protect from frost in northern regions.",
      "storageTips": "Flowers are highly perishable. Leaves can be dried and stored for medicinal use.",
      "growthForm": "Large shrub or small tree growing up to 10 meters tall",
      "specification": "Flowers bloom at night and drop in the morning. Orange flower tubes with white petals create a distinctive appearance."
    },
    {
      "commonName": "Custard Apple (Sitaphal)",
      "scientificName": "Annona squamosa",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Sweet fruit eaten fresh. Seeds and leaves used in traditional medicine to treat lice and skin conditions.",
      "waterNeeds": "Moderate; water deeply and infrequently",
      "sunlightNeeds": "Full sun",
      "careTips": "Prune to maintain size and shape. Apply mulch to retain moisture. Protect from frost.",
      "storageTips": "Ripe fruits can be refrigerated for 2-3 days. Can be frozen as pulp.",
      "growthForm": "Small deciduous tree growing up to 6-8 meters tall",
      "specification": "Hand pollination may improve fruit set. Seeds are toxic and should not be consumed."
    },
    {
      "commonName": "Drumstick Tree (Moringa)",
      "scientificName": "Moringa oleifera",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Pods used as vegetable. Leaves, flowers, and seeds are edible and highly nutritious. Used in traditional medicine.",
      "waterNeeds": "Low; drought-tolerant once established",
      "sunlightNeeds": "Full sun",
      "careTips": "Can be grown as annual or perennial. Prune regularly to promote branching. Protect from frost.",
      "storageTips": "Fresh leaves last 3-4 days in refrigeration. Can be dried and powdered for longer storage.",
      "growthForm": "Fast-growing deciduous tree up to 12 meters tall",
      "specification": "Known as 'Miracle Tree' due to exceptional nutritional content. All parts of the plant are usable and beneficial."
    },
    {
      "commonName": "Dhatura (Devil's Trumpet)",
      "scientificName": "Datura metel",
      "image": "tulsi",
      "type": ["medicinal", "poisonous", "religious"],
      "use": "Used in religious ceremonies associated with Lord Shiva. Used externally in traditional medicine for pain relief.",
      "waterNeeds": "Moderate; tolerates dry periods",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Keep away from children and pets due to high toxicity. Can become invasive in some areas.",
      "storageTips": "Not recommended for home storage due to high toxicity.",
      "growthForm": "Shrubby annual or short-lived perennial growing up to 1.5 meters tall",
      "specification": "Highly toxic if ingested. Contains tropane alkaloids that can cause hallucinations, severe toxicity, and death."
    },
    {
      "commonName": "Indian Bay Leaf (Tej Patta)",
      "scientificName": "Cinnamomum tamala",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used as spice in Indian cooking. Also used in traditional medicine for digestion and diabetes.",
      "waterNeeds": "Moderate; keep soil evenly moist",
      "sunlightNeeds": "Partial shade to full sun",
      "careTips": "Protect from frost. Apply balanced fertilizer during growing season. Prune to maintain shape.",
      "storageTips": "Dried leaves can be stored in airtight containers for up to a year, away from direct light.",
      "growthForm": "Evergreen tree growing up to 20 meters tall",
      "specification": "Different from European bay leaf (Laurus nobilis). Has three prominent veins running along the length of the leaf."
    },
    {
      "commonName": "Ajwain (Carom Seeds)",
      "scientificName": "Trachyspermum ammi",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Seeds used as spice in cooking and for medicinal purposes, particularly for digestive disorders.",
      "waterNeeds": "Moderate; keep soil consistently moist until established",
      "sunlightNeeds": "Full sun",
      "careTips": "Sow directly in well-draining soil. Thin seedlings to 30 cm apart. Harvest when seeds turn brownish-gray.",
      "storageTips": "Store dried seeds in airtight containers in cool, dry place for up to 3 years.",
      "growthForm": "Annual herb growing up to 1-1.5 meters tall",
      "specification": "Contains thymol which gives it distinctive aroma and medicinal properties. Often used in chutneys and pickles."
    },
    {
      "commonName": "Money Plant",
      "scientificName": "Epipremnum aureum",
      "image": "tulsi",
      "type": ["decorative", "luck"],
      "use": "Popular houseplant believed to bring wealth and prosperity. Also purifies indoor air.",
      "waterNeeds": "Moderate; allow top inch of soil to dry between watering",
      "sunlightNeeds": "Bright indirect light",
      "careTips": "Grows well in hanging baskets or climbing up moss poles. Prune to control size and promote bushiness.",
      "storageTips": "Not applicable for storage; grown as living plant.",
      "growthForm": "Evergreen vine with heart-shaped variegated leaves",
      "specification": "Mildly toxic if ingested. Can grow up to 20 meters in natural habitat. Easy to propagate from stem cuttings."
    },
    {
      "commonName": "Snake Plant",
      "scientificName": "Dracaena trifasciata",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Popular houseplant known for air purification qualities. Tolerates low light and irregular watering.",
      "waterNeeds": "Low; water every 2-3 weeks",
      "sunlightNeeds": "Low to bright indirect light",
      "careTips": "Avoid overwatering as it's susceptible to root rot. Wipe leaves occasionally to remove dust.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Evergreen perennial with upright, sword-like leaves",
      "specification": "Also called Mother-in-Law's Tongue. Removes toxins like formaldehyde and benzene from air."
    },
    {
      "commonName": "Mint (Pudina)",
      "scientificName": "Mentha spicata",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used in chutneys, drinks, and as digestive aid. Has cooling properties.",
      "waterNeeds": "High; keep soil moist (water every 2 days)",
      "sunlightNeeds": "Partial sun (4-6 hours)",
      "careTips": "Grows aggressively; best grown in containers. Pinch back regularly to promote bushiness.",
      "storageTips": "Fresh leaves last about a week refrigerated in damp paper towel. Can be frozen in ice cubes.",
      "growthForm": "Fast-growing perennial herb spreading by runners",
      "specification": "Several varieties grown in India including peppermint and spearmint. Used in traditional remedies for indigestion."
    },
    {
      "commonName": "Coriander (Dhania)",
      "scientificName": "Coriandrum sativum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used as garnish and in chutneys. Seeds used as spice. Has digestive benefits.",
      "waterNeeds": "Moderate; water every 2-3 days",
      "sunlightNeeds": "Partial sun (4-5 hours)",
      "careTips": "Sow seeds directly as it doesn't transplant well. Harvest leaves regularly to delay bolting.",
      "storageTips": "Fresh leaves last about a week in refrigerator. Seeds can be dried and stored for years.",
      "growthForm": "Annual herb growing up to 50 cm tall",
      "specification": "Whole plant is edible - leaves, stems, seeds and roots. Quick-growing crop ready in 3-4 weeks."
    },
    {
      "commonName": "Jade Plant",
      "scientificName": "Crassula ovata",
      "image": "tulsi",
      "type": ["decorative", "luck"],
      "use": "Popular succulent believed to bring good luck and prosperity. Often gifted for housewarmings.",
      "waterNeeds": "Low; water every 2-3 weeks",
      "sunlightNeeds": "Bright light (4-6 hours)",
      "careTips": "Allow soil to dry completely between watering. Prune to maintain shape. Protect from frost.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Evergreen succulent with thick, glossy leaves",
      "specification": "Also called Money Plant or Dollar Plant. Can live for decades with proper care."
    },
    {
      "commonName": "Chili Pepper",
      "scientificName": "Capsicum annuum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Fruits used in cooking for heat and flavor. Contains capsaicin with pain-relieving properties.",
      "waterNeeds": "Moderate; water when topsoil is dry",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Support plants with stakes when fruiting. Harvest regularly to encourage more production.",
      "storageTips": "Fresh chilies last about a week refrigerated. Can be dried or frozen for longer storage.",
      "growthForm": "Annual shrub growing up to 1 meter tall",
      "specification": "Many varieties grown in India from mild to extremely hot. Includes popular types like Guntur and Kashmiri."
    },
    {
      "commonName": "Peace Lily",
      "scientificName": "Spathiphyllum wallisii",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Popular indoor plant known for air purification and elegant white flowers. Helps remove toxins from air.",
      "waterNeeds": "Moderate; water when soil feels dry",
      "sunlightNeeds": "Low to medium indirect light",
      "careTips": "Dust leaves regularly. Repot when rootbound. Remove spent flowers to encourage new blooms.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Herbaceous perennial with glossy leaves and white spathes",
      "specification": "Dramatic drooping when thirsty makes watering needs obvious. NASA-certified air purifier."
    },
    {
      "commonName": "Tomato",
      "scientificName": "Solanum lycopersicum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Fruits used widely in Indian cuisine. Rich in lycopene with antioxidant properties.",
      "waterNeeds": "Moderate; deep watering 2-3 times/week",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Provide support for vines. Remove suckers for better fruit production. Rotate crops annually.",
      "storageTips": "Store ripe tomatoes at room temperature. Can be preserved as sauce, paste or sun-dried.",
      "growthForm": "Annual vine growing up to 2 meters tall",
      "specification": "Many varieties grown in India including cherry, roma and beefsteak types. Technically a fruit but used as vegetable."
    },
    {
      "commonName": "Dwarf Lemon Tree",
      "scientificName": "Citrus limon",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Fruits used for juice, flavoring and medicinal purposes. High in vitamin C.",
      "waterNeeds": "Moderate; water when top 2 inches are dry",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Fertilize regularly with citrus-specific fertilizer. Protect from frost. Prune to maintain size.",
      "storageTips": "Fruits can be stored at room temperature or refrigerated. Juice can be frozen.",
      "growthForm": "Small evergreen tree growing up to 2-3 meters",
      "specification": "Popular dwarf varieties suitable for container growing. Flowers are fragrant and attract pollinators."
    },
    {
      "commonName": "Spider Plant",
      "scientificName": "Chlorophytum comosum",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Popular hanging plant known for air purification and easy propagation via plantlets.",
      "waterNeeds": "Moderate; water weekly",
      "sunlightNeeds": "Bright, indirect light",
      "careTips": "Remove brown tips by trimming. Repot when rootbound. Propagate by planting the baby spiderettes.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Herbaceous perennial with arching leaves and dangling plantlets",
      "specification": "One of the easiest houseplants to grow. Effective at removing formaldehyde from indoor air."
    },
    {
      "commonName": "Areca Palm",
      "scientificName": "Dypsis lutescens",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Popular indoor palm that adds tropical feel to spaces. Helps humidify indoor air.",
      "waterNeeds": "Moderate; keep soil slightly moist",
      "sunlightNeeds": "Bright, indirect light",
      "careTips": "Mist leaves regularly. Wipe leaves to remove dust. Fertilize during growing season.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Clustering palm with feathery fronds growing up to 2-3 meters indoors",
      "specification": "Also called Butterfly Palm. NASA-certified air purifier. Prefers humid conditions."
    },
    {
      "commonName": "Indian Borage (Ajwain)",
      "scientificName": "Plectranthus amboinicus",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used for flavoring and medicinal purposes, especially for cough and cold relief.",
      "waterNeeds": "Moderate; water twice a week",
      "sunlightNeeds": "Partial sun (4-6 hours)",
      "careTips": "Pinch back regularly to encourage bushiness. Can be grown in containers. Protect from frost.",
      "storageTips": "Fresh leaves last about a week refrigerated. Can be dried for longer storage.",
      "growthForm": "Succulent perennial herb growing up to 1 meter tall",
      "specification": "Also called Cuban Oregano. Leaves have strong oregano-like flavor with hint of thyme."
    },
    {
      "commonName": "Rose (Desi Gulab)",
      "scientificName": "Rosa indica",
      "image": "tulsi",
      "type": ["decorative", "religious", "medicinal"],
      "use": "Flowers used in religious ceremonies, perfumes, and traditional medicine. Rose water used in cooking.",
      "waterNeeds": "Moderate; deep watering twice a week",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Prune after flowering. Remove dead wood. Watch for pests like aphids and black spot.",
      "storageTips": "Fresh flowers last a few days. Petals can be dried for potpourri or made into rose water.",
      "growthForm": "Deciduous shrub with thorny stems growing up to 2 meters",
      "specification": "Many traditional Indian varieties with strong fragrance. Flowers used in Ayurvedic preparations."
    },
    {
      "commonName": "Lavender",
      "scientificName": "Lavandula angustifolia",
      "image": "tulsi",
      "type": ["decorative", "medicinal"],
      "use": "Flowers used for fragrance, relaxation, and in traditional medicine for anxiety relief.",
      "waterNeeds": "Low; light watering",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Prune after flowering to maintain shape. Plant in well-draining soil. Protect from excessive humidity.",
      "storageTips": "Dry flower spikes upside down in bunches. Store dried flowers in airtight containers.",
      "growthForm": "Aromatic perennial shrub growing up to 1 meter tall",
      "specification": "Essential oil has calming properties. Flowers attract pollinators like bees and butterflies."
    },
    {
      "commonName": "Oregano",
      "scientificName": "Origanum vulgare",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used as culinary herb and in traditional medicine for respiratory ailments.",
      "waterNeeds": "Low; let soil dry between watering",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Harvest leaves before flowering for best flavor. Divide plants every few years to rejuvenate.",
      "storageTips": "Dry leaves and store in airtight containers. Fresh sprigs can be refrigerated for a week.",
      "growthForm": "Perennial herb growing up to 60 cm tall",
      "specification": "Contains thymol and carvacrol with antimicrobial properties. Flavor intensifies when dried."
    },
    {
      "commonName": "Spinach (Palak)",
      "scientificName": "Spinacia oleracea",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leafy green used in saag, curries, and parathas. Rich in iron and calcium for bone health.",
      "waterNeeds": "High; keep soil consistently moist",
      "sunlightNeeds": "Partial shade (3-5 hours)",
      "careTips": "Harvest outer leaves first to prolong production. Plant in cool seasons for best yield.",
      "storageTips": "Refrigerate in airtight bags for up to 1 week. Blanch and freeze for long-term storage.",
      "growthForm": "Annual leafy vegetable growing up to 30 cm tall",
      "specification": "Traditional winter crop in North India. Contains oxalic acid which reduces when cooked."
    },
    {
      "commonName": "Fenugreek (Methi)",
      "scientificName": "Trigonella foenum-graecum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves used fresh/dried in curries. Seeds for tempering and diabetes management.",
      "waterNeeds": "Moderate; light watering every 2 days",
      "sunlightNeeds": "Partial sun (4-6 hours)",
      "careTips": "Soak seeds overnight before sowing. Harvest leaves when young for best flavor.",
      "storageTips": "Dry leaves can be stored for months. Seeds last 2-3 years in airtight containers.",
      "growthForm": "Annual herb growing up to 60 cm tall",
      "specification": "Sprouted seeds (methi microgreens) are highly nutritious. Traditional galactagogue for nursing mothers."
    },
    {
      "commonName": "Okra (Bhindi)",
      "scientificName": "Abelmoschus esculentus",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Pods used in sambar, stir-fries, and kurma. Mucilage aids digestion.",
      "waterNeeds": "Moderate; deep watering twice weekly",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Wear gloves when harvesting to avoid irritation from tiny spines. Remove old pods to prolong fruiting.",
      "storageTips": "Store unwashed in paper towels in fridge for 3-4 days. Can be pickled or frozen.",
      "growthForm": "Annual flowering plant growing up to 2 meters",
      "specification": "Heat-loving crop with varieties like Pusa Sawani. Flowers resemble hibiscus (same family)."
    },
    {
      "commonName": "Brinjal (Eggplant)",
      "scientificName": "Solanum melongena",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Fruits used in baingan bharta, curries. Nasunin in skin is potent antioxidant.",
      "waterNeeds": "High; don't let soil dry out",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Stake plants to support heavy fruits. Rotate crops to prevent verticillium wilt.",
      "storageTips": "Store at cool room temperature (not fridge). Best used within 2-3 days of harvest.",
      "growthForm": "Perennial grown as annual, up to 1.5 meters tall",
      "specification": "Many Indian varieties: round purple (Bharwa), long green (Hyderabad), and tiny pea brinjal."
    },
    {
      "commonName": "Rubber Plant",
      "scientificName": "Ficus elastica",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Ornamental plant with large glossy leaves. Removes indoor air pollutants.",
      "waterNeeds": "Moderate; let soil dry between watering",
      "sunlightNeeds": "Bright, indirect light",
      "careTips": "Wipe leaves monthly to remove dust. Prune top to encourage bushiness. Avoid cold drafts.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Evergreen tree up to 2-3 meters indoors",
      "specification": "Sap was historically used for rubber production. Burgundy varieties popular in Indian homes."
    },
    {
      "commonName": "ZZ Plant",
      "scientificName": "Zamioculcas zamiifolia",
      "image": "tulsi",
      "type": ["decorative", "luck"],
      "use": "Low-maintenance houseplant believed to bring prosperity. Thrives in neglect.",
      "waterNeeds": "Low; water every 2-3 weeks",
      "sunlightNeeds": "Low to bright indirect light",
      "careTips": "Overwatering is main killer. Tolerates fluorescent lighting. Dust leaves occasionally.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Herbaceous perennial with glossy pinnate leaves",
      "specification": "Drought-resistant due to rhizomes that store water. All parts are mildly toxic if ingested."
    },
    {
      "commonName": "Hibiscus (Gudhal)",
      "scientificName": "Hibiscus rosa-sinensis",
      "image": "tulsi",
      "type": ["decorative", "religious", "medicinal"],
      "use": "Flowers offered to deities. Used in hair oils and herbal teas for hypertension.",
      "waterNeeds": "Moderate; water deeply 2-3 times weekly",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Deadhead spent blooms. Prune in early spring. Watch for hibiscus beetle.",
      "storageTips": "Fresh flowers last 1 day. Dry petals for tea in shade and store airtight.",
      "growthForm": "Evergreen shrub up to 3 meters tall",
      "specification": "National flower of Malaysia. Double-petal varieties popular in temple offerings."
    },
    {
      "commonName": "Pothos (Devil's Ivy)",
      "scientificName": "Epipremnum aureum",
      "image": "tulsi",
      "type": ["decorative", "air-purifying"],
      "use": "Trailing vine for shelves/walls. Removes formaldehyde from air.",
      "waterNeeds": "Low; let soil dry between watering",
      "sunlightNeeds": "Low to bright indirect light",
      "careTips": "Trim long vines to encourage fullness. Can grow in water indefinitely.",
      "storageTips": "Not applicable; grown as living plant.",
      "growthForm": "Evergreen vine with heart-shaped leaves",
      "specification": "Variegated varieties (Golden Pothos) brighten dim corners. One of most forgiving houseplants."
    },
    {
      "commonName": "Basil (Sweet Basil)",
      "scientificName": "Ocimum basilicum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves for Italian dishes and Thai curries. Essential oil has anti-microbial properties.",
      "waterNeeds": "Moderate; keep soil moist",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Pinch off flower buds to prolong leaf production. Grow indoors in winters.",
      "storageTips": "Freeze leaves in oil or dry them. Fresh lasts 1 week in fridge with stems in water.",
      "growthForm": "Annual herb up to 60 cm tall",
      "specification": "Different from holy basil (Tulsi). Large-leaf Genovese type used in pesto."
    },
    {
      "commonName": "Thyme",
      "scientificName": "Thymus vulgaris",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Culinary herb for meats/stews. Thymol in oil is potent antiseptic.",
      "waterNeeds": "Low; let soil dry between watering",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Prune woody stems to encourage new growth. Prefers slightly alkaline soil.",
      "storageTips": "Dry sprigs upside down. Store leaves whole to retain flavor, crush when needed.",
      "growthForm": "Perennial subshrub up to 30 cm tall",
      "specification": "Creeping varieties make aromatic ground cover. Flowers attract bees."
    },
    {
      "commonName": "Parsley",
      "scientificName": "Petroselinum crispum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Garnish and flavoring. High in vitamin K for blood clotting.",
      "waterNeeds": "Moderate; keep soil consistently moist",
      "sunlightNeeds": "Partial sun (4-6 hours)",
      "careTips": "Soak seeds overnight to speed germination. Biennial but grown as annual.",
      "storageTips": "Store stems in water in fridge like flowers. Can be frozen in oil cubes.",
      "growthForm": "Biennial herb up to 30 cm tall",
      "specification": "Two types: flat-leaf (Italian) and curly. Former has stronger flavor."
    },
    {
      "commonName": "Dill",
      "scientificName": "Anethum graveolens",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Leaves/flavor pickles (dill pickles). Seeds for digestive tea.",
      "waterNeeds": "Moderate; don't overwater",
      "sunlightNeeds": "Full sun (6-8 hours)",
      "careTips": "Plant away from fennel to prevent cross-pollination. Stake tall varieties.",
      "storageTips": "Freeze leaves in water cubes. Dry seeds in paper bags before storing.",
      "growthForm": "Annual herb up to 1.5 meters tall",
      "specification": "Feathery leaves are larval food for swallowtail butterflies."
    },
    {
      "commonName": "Chives",
      "scientificName": "Allium schoenoprasum",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Mild onion-flavored garnish. Contains allicin with cardiovascular benefits.",
      "waterNeeds": "Moderate; water when dry",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Divide clumps every 3-4 years. Cut back to 5 cm to rejuvenate growth.",
      "storageTips": "Refrigerate in damp paper towel. Freeze chopped leaves in oil.",
      "growthForm": "Perennial bulb-forming herb up to 50 cm tall",
      "specification": "Edible purple flowers attract pollinators. Cold-hardy and deer-resistant."
    },
    {
      "commonName": "Rosemary",
      "scientificName": "Salvia rosmarinus",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Aromatic herb for meats/breads. Improves memory and concentration.",
      "waterNeeds": "Low; drought-tolerant",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Prune lightly but regularly. Avoid wet feet in monsoon. Grows well in containers.",
      "storageTips": "Dry sprigs or freeze in oil. Fresh lasts 3 weeks in fridge wrapped in damp cloth.",
      "growthForm": "Perennial woody shrub up to 1.5 meters tall",
      "specification": "Blue flowers attract bees. Prostrate varieties good for rock gardens."
    },
    {
      "commonName": "Sage",
      "scientificName": "Salvia officinalis",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Thanksgiving stuffing herb. Sage tea for sore throats.",
      "waterNeeds": "Low; let soil dry between watering",
      "sunlightNeeds": "Full sun (6+ hours)",
      "careTips": "Prune woody stems in spring. Prefers poor, rocky soil over rich compost.",
      "storageTips": "Leaves dry well. Store whole leaves in glass jars away from light.",
      "growthForm": "Perennial subshrub up to 60 cm tall",
      "specification": "Variegated (tricolor) varieties popular for ornamental use. Flowers attract hummingbirds."
    },
    {
      "commonName": "Bay Leaf (Tej Patta)",
      "scientificName": "Laurus nobilis",
      "image": "tulsi",
      "type": ["food", "medicinal"],
      "use": "Aromatic leaves for biryanis and stews. Helps regulate blood sugar.",
      "waterNeeds": "Moderate; let soil dry between watering",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Prune to shape as topiary. Protect from cold winds. Slow grower.",
      "storageTips": "Dry leaves for 48 hours before storing. Flavor intensifies after a few weeks.",
      "growthForm": "Evergreen tree up to 12 meters tall",
      "specification": "Ancient symbol of wisdom. Leaves used in Greek/Roman laurel wreaths."
    },
    {
      "commonName": "Stevia",
      "scientificName": "Stevia rebaudiana",
      "image": "tulsi",
      "type": ["medicinal", "food"],
      "use": "Natural zero-calorie sweetener. Helps manage diabetes.",
      "waterNeeds": "Moderate; don't overwater",
      "sunlightNeeds": "Full sun to partial shade",
      "careTips": "Pinch back for bushiness. Bring indoors in cold regions. Perennial in tropics.",
      "storageTips": "Dry leaves and powder them. 1 tsp powder = 1 cup sugar sweetness.",
      "growthForm": "Perennial herb up to 1 meter tall",
      "specification": "300x sweeter than sugar. Approved as sugar substitute in 2015 in India."
    },
    {
      "commonName": "Gotu Kola",
      "scientificName": "Centella asiatica",
      "image": "tulsi",
      "type": ["medicinal"],
      "use": "Ayurvedic brain tonic. Promotes wound healing and vein health.",
      "waterNeeds": "High; keep soil moist",
      "sunlightNeeds": "Partial shade to full sun",
      "careTips": "Grows well as ground cover. Can become invasive in ideal conditions.",
      "storageTips": "Fresh leaves best. Can be dried but loses potency quickly.",
      "growthForm": "Perennial creeping herb",
      "specification": "Called 'Brahmi' in North India. Different from Bacopa monnieri (true Brahmi)."
    },
    {
      "commonName": "Giloy",
      "scientificName": "Tinospora cordifolia",
      "image": "tulsi",
      "type": ["medicinal"],
      "use": "Ayurvedic immunity booster. Used for fever, diabetes and arthritis.",
      "waterNeeds": "Moderate; water when dry",
      "sunlightNeeds": "Partial shade to full sun",
      "careTips": "Needs strong support structure. Prune to control aggressive growth.",
      "storageTips": "Stems can be dried and stored for decoctions. Fresh juice most potent.",
      "growthForm": "Perennial deciduous climber",
      "specification": "Called 'Amrita' in Sanskrit. Grows over neem tree is considered most medicinal."
    },
    {
      "commonName": "Shatavari",
      "scientificName": "Asparagus racemosus",
      "image": "tulsi",
      "type": ["medicinal"],
      "use": "Women's health tonic. Galactagogue and hormonal balancer.",
      "waterNeeds": "Moderate; drought-tolerant",
      "sunlightNeeds": "Partial shade to full sun",
      "careTips": "Provide trellis for climbing. Harvest roots after 2 years.",
      "storageTips": "Dry roots and powder for storage. Keep in amber glass jars.",
      "growthForm": "Perennial climbing shrub",
      "specification": "Called 'Queen of Herbs' in Ayurveda. 100 roots = Shatavari (Sanskrit meaning)."
    }
]
